harmim/vut-imp-project/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MK60DN512xxx10
package_id: MK60DN512VMD10
mcu_data: ksdk2_0
processor_version: 4.0.0
pin_labels:
- {pin_num: C9, pin_signal: PTD8/I2C0_SCL/UART5_RX/FB_A16, label: DISP_C1, identifier: DISP_C1}
- {pin_num: B9, pin_signal: PTD9/I2C0_SDA/UART5_TX/FB_A17, label: DISP_C4, identifier: DISP_C4}
- {pin_num: B1, pin_signal: PTD12/SPI2_SCK/SDHC0_D4/FB_A20, label: DISP_C3, identifier: DISP_C3}
- {pin_num: C3, pin_signal: PTD13/SPI2_SOUT/SDHC0_D5/FB_A21, label: DISP_C2, identifier: DISP_C2}
- {pin_num: K8, pin_signal: ADC0_SE11/PTA8/FTM1_CH0/FTM1_QD_PHA/TRACE_D2, label: DISP_DP, identifier: DISP_DP}
- {pin_num: M9, pin_signal: PTA10/FTM2_CH0/MII0_RXD2/FTM2_QD_PHA/TRACE_D0, label: DISP_D, identifier: DISP_D}
- {pin_num: J7, pin_signal: PTA6/FTM0_CH3/TRACE_CLKOUT, label: DISP_E, identifier: DISP_E}
- {pin_num: L9, pin_signal: PTA11/FTM2_CH1/MII0_RXCLK/FTM2_QD_PHB, label: DISP_A, identifier: DISP_A}
- {pin_num: J8, pin_signal: ADC0_SE10/PTA7/FTM0_CH4/TRACE_D3, label: DISP_F, identifier: DISP_F}
- {pin_num: L8, pin_signal: PTA9/FTM1_CH1/MII0_RXD3/FTM1_QD_PHB/TRACE_D1, label: DISP_B, identifier: DISP_B}
- {pin_num: C2, pin_signal: PTD14/SPI2_SIN/SDHC0_D6/FB_A22, label: DISP_C, identifier: DISP_C}
- {pin_num: C1, pin_signal: PTD15/SPI2_PCS1/SDHC0_D7/FB_A23, label: DISP_G, identifier: DISP_G}
- {pin_num: L1, pin_signal: PGA0_DP/ADC0_DP0/ADC1_DP3, label: SENSOR, identifier: SENSOR}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: C9, peripheral: GPIOD, signal: 'GPIO, 8', pin_signal: PTD8/I2C0_SCL/UART5_RX/FB_A16, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: B9, peripheral: GPIOD, signal: 'GPIO, 9', pin_signal: PTD9/I2C0_SDA/UART5_TX/FB_A17, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: B1, peripheral: GPIOD, signal: 'GPIO, 12', pin_signal: PTD12/SPI2_SCK/SDHC0_D4/FB_A20, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: C3, peripheral: GPIOD, signal: 'GPIO, 13', pin_signal: PTD13/SPI2_SOUT/SDHC0_D5/FB_A21, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: M9, peripheral: GPIOA, signal: 'GPIO, 10', pin_signal: PTA10/FTM2_CH0/MII0_RXD2/FTM2_QD_PHA/TRACE_D0, direction: OUTPUT}
  - {pin_num: J7, peripheral: GPIOA, signal: 'GPIO, 6', pin_signal: PTA6/FTM0_CH3/TRACE_CLKOUT, direction: OUTPUT}
  - {pin_num: L9, peripheral: GPIOA, signal: 'GPIO, 11', pin_signal: PTA11/FTM2_CH1/MII0_RXCLK/FTM2_QD_PHB, direction: OUTPUT}
  - {pin_num: J8, peripheral: GPIOA, signal: 'GPIO, 7', pin_signal: ADC0_SE10/PTA7/FTM0_CH4/TRACE_D3, direction: OUTPUT}
  - {pin_num: L8, peripheral: GPIOA, signal: 'GPIO, 9', pin_signal: PTA9/FTM1_CH1/MII0_RXD3/FTM1_QD_PHB/TRACE_D1, direction: OUTPUT}
  - {pin_num: C2, peripheral: GPIOD, signal: 'GPIO, 14', pin_signal: PTD14/SPI2_SIN/SDHC0_D6/FB_A22, direction: OUTPUT}
  - {pin_num: C1, peripheral: GPIOD, signal: 'GPIO, 15', pin_signal: PTD15/SPI2_PCS1/SDHC0_D7/FB_A23, direction: OUTPUT}
  - {pin_num: L1, peripheral: ADC0, signal: 'DP, 0', pin_signal: PGA0_DP/ADC0_DP0/ADC1_DP3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    gpio_pin_config_t DISP_E_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA6 (pin J7)  */
    GPIO_PinInit(BOARD_INITPINS_DISP_E_GPIO, BOARD_INITPINS_DISP_E_PIN, &DISP_E_config);

    gpio_pin_config_t DISP_F_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA7 (pin J8)  */
    GPIO_PinInit(BOARD_INITPINS_DISP_F_GPIO, BOARD_INITPINS_DISP_F_PIN, &DISP_F_config);

    gpio_pin_config_t DISP_B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA9 (pin L8)  */
    GPIO_PinInit(BOARD_INITPINS_DISP_B_GPIO, BOARD_INITPINS_DISP_B_PIN, &DISP_B_config);

    gpio_pin_config_t DISP_D_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA10 (pin M9)  */
    GPIO_PinInit(BOARD_INITPINS_DISP_D_GPIO, BOARD_INITPINS_DISP_D_PIN, &DISP_D_config);

    gpio_pin_config_t DISP_A_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA11 (pin L9)  */
    GPIO_PinInit(BOARD_INITPINS_DISP_A_GPIO, BOARD_INITPINS_DISP_A_PIN, &DISP_A_config);

    gpio_pin_config_t DISP_C1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD8 (pin C9)  */
    GPIO_PinInit(BOARD_INITPINS_DISP_C1_GPIO, BOARD_INITPINS_DISP_C1_PIN, &DISP_C1_config);

    gpio_pin_config_t DISP_C4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD9 (pin B9)  */
    GPIO_PinInit(BOARD_INITPINS_DISP_C4_GPIO, BOARD_INITPINS_DISP_C4_PIN, &DISP_C4_config);

    gpio_pin_config_t DISP_C3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD12 (pin B1)  */
    GPIO_PinInit(BOARD_INITPINS_DISP_C3_GPIO, BOARD_INITPINS_DISP_C3_PIN, &DISP_C3_config);

    gpio_pin_config_t DISP_C2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTD13 (pin C3)  */
    GPIO_PinInit(BOARD_INITPINS_DISP_C2_GPIO, BOARD_INITPINS_DISP_C2_PIN, &DISP_C2_config);

    gpio_pin_config_t DISP_C_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD14 (pin C2)  */
    GPIO_PinInit(BOARD_INITPINS_DISP_C_GPIO, BOARD_INITPINS_DISP_C_PIN, &DISP_C_config);

    gpio_pin_config_t DISP_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD15 (pin C1)  */
    GPIO_PinInit(BOARD_INITPINS_DISP_G_GPIO, BOARD_INITPINS_DISP_G_PIN, &DISP_G_config);

    /* PORTA10 (pin M9) is configured as PTA10 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_D_PORT, BOARD_INITPINS_DISP_D_PIN, kPORT_MuxAsGpio);

    /* PORTA11 (pin L9) is configured as PTA11 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_A_PORT, BOARD_INITPINS_DISP_A_PIN, kPORT_MuxAsGpio);

    /* PORTA6 (pin J7) is configured as PTA6 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_E_PORT, BOARD_INITPINS_DISP_E_PIN, kPORT_MuxAsGpio);

    /* PORTA7 (pin J8) is configured as PTA7 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_F_PORT, BOARD_INITPINS_DISP_F_PIN, kPORT_MuxAsGpio);

    /* PORTA9 (pin L8) is configured as PTA9 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_B_PORT, BOARD_INITPINS_DISP_B_PIN, kPORT_MuxAsGpio);

    /* PORTD12 (pin B1) is configured as PTD12 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_C3_PORT, BOARD_INITPINS_DISP_C3_PIN, kPORT_MuxAsGpio);

    /* PORTD13 (pin C3) is configured as PTD13 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_C2_PORT, BOARD_INITPINS_DISP_C2_PIN, kPORT_MuxAsGpio);

    /* PORTD14 (pin C2) is configured as PTD14 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_C_PORT, BOARD_INITPINS_DISP_C_PIN, kPORT_MuxAsGpio);

    /* PORTD15 (pin C1) is configured as PTD15 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_G_PORT, BOARD_INITPINS_DISP_G_PIN, kPORT_MuxAsGpio);

    /* PORTD8 (pin C9) is configured as PTD8 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_C1_PORT, BOARD_INITPINS_DISP_C1_PIN, kPORT_MuxAsGpio);

    /* PORTD9 (pin B9) is configured as PTD9 */
    PORT_SetPinMux(BOARD_INITPINS_DISP_C4_PORT, BOARD_INITPINS_DISP_C4_PIN, kPORT_MuxAsGpio);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
